#+Title: Exercises in Mathematics, Algorithmics and Computer Programming
#+AUTHOR: Evans Winner
#+OPTIONS: tex:verbatim 
#+OPTIONS: tex:t
#+LaTeX_CLASS: article

* Introduction

First, this is the Emacs Lisp that is required in order to export the
org-mode buffer of this file to PDF:

#+begin_src emacs-lisp
(require 'org-install)
(require 'ob-tangle)
(require 'ob-shen)
(require 'ox-latex)
(require 'ob-scheme)
(setq org-latex-pdf-process '("lualatex %f"))
(setq org-src-fontify-natively t)
(setq org-latex-listings nil) ; doesn’t work because the LaTeX
                              ; ‘listings’ package doesn’t have
                              ; a shen backend.

(setq org-latex-default-packages-alist
      '(
       ("" "amsmath" t)
       ("" "amsthm" t)
       ("T1" "fontenc" t)
       ("" "fixltx2e" nil)
       ("" "graphicx" t)
       ("" "longtable" nil)
       ("" "float" nil)
       ("" "wrapfig" nil)
       ("normalem" "ulem" t)
       ("" "textcomp" t)
       ("" "marvosym" t)
       ("" "wasysym" t)
       ("" "latexsym" t)
       ("" "amssymb" t)
       ("" "amstext" nil)
       ("" "hyperref" nil)
       ("" "fontspec" t)
       ("" "tabularx" t)
       ("" "enumerate" t)
       ("utf8x" "luainputenc" t)
       ("" "unicode-math" t0)
       "\\setmathfont{Latin Modern Math}"
       "\\setmathfont{STIXGeneral}"
       "\\tolerance=1000"))
(org-babel-do-load-languages
 'org-babel-load-languages
 '((scheme . t)
   (emacs-lisp . t)
   ))
#+end_src

#+RESULTS:
| (scheme . t) | (emacs-lisp . t) |

This is a record of my progress toward my goal of teaching myself the
rudiments of mathematics, algorithmics and something of computer
programming.  Having completed only the first year of high-school
Algebra and two college courses in basic symbolic logic, I intend to
learn a) basic “pre-calculus” and trigonometry, the equivalent of a
first-year college course in the integral and differential calculous,
the basics of symbolic and mathematical logic, the basics of discrete
mathematics (graphs, matrix algebra, categories) and the basics of
algorithmics, data structures and programming language semantics
(type theory, et cetera).

To this end, here follow worked exercises from whatsoever books on the
subjects I find and take the time to work.  I further take this
opportunity to improve my command of \LaTeX\ math markup, GNU Emacs,
org-mode and related tools.

